<?xml version="1.0" encoding="utf-8"?>
<page>
  <attributes>
    <pagename>Senior Software Developer</pagename>
    <name>senior_software_developer</name>
    <menuname>Senior Software Developer</menuname>
    <pageidentifier>german/about/jobs/senior_software_developer</pageidentifier>
    <status>open</status>
    <template></template>
    <metakeywords></metakeywords>
    <metadescription>Einen engagierten Senior Software Developer (C#, WCF, XAML, ASP.NET, HTML, Javascript)</metadescription>
    <lastedited></lastedited>
  </attributes>
  <containers>
    <container name="content">
      <elements>
        <element type="paragraph">
          <text>&lt;h1&gt;Softwareentwickler (w/m)&lt;/h1&gt;&lt;p&gt;Die GUTSCH-ONLINE Software GmbH sucht zum 1. Oktober 2010 erfahrene Softwareentwickler und Berater.&lt;/p&gt;&lt;p&gt;Ihr Profil:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;mindestens 3 Jahre Erfahrung mit .NET 4.0 (C# und VB.NET)&lt;/li&gt;&lt;li&gt;Kenntnisse in Silverlight, WPF, ASP.NET, ASP.NET MVC, WCF, WF&lt;/li&gt;&lt;li&gt;gute HTML, CSS und JavaScript Kenntnisse.&lt;/li&gt;&lt;li&gt;gute SQL Kenntnisse&lt;/li&gt;&lt;li&gt;Erfahrungen mit Unit-Tests (TDD von Vorteil)&lt;/li&gt;&lt;li&gt;Kenntnisse in weiteren Sprachen sind von Vorteil (Java, Ruby, Python)&lt;/li&gt;&lt;li&gt;flie&amp;szlig;end Deutsch und gutes Englisch&lt;/li&gt;&lt;li&gt;vertraut mit Agiler Softwareentwicklung&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Weitere Eigenschaften:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Engagement&lt;/li&gt;&lt;li&gt;Interesse an der Technologie&lt;/li&gt;&lt;li&gt;Lernbereitschaft&lt;/li&gt;&lt;li&gt;Qualit&amp;auml;tsbewusstsein&lt;/li&gt;&lt;li&gt;Community-Aktivit&amp;auml;ten sind w&amp;uuml;nschenswert&lt;/li&gt;&lt;li&gt;vertraut mit den Prinzipien und Praktiken der &amp;quot;Clean Code Developer&amp;quot;-Initiative &lt;/li&gt;&lt;li&gt;Erfahrungen als Berater und Trainer sind ebenfalls w&amp;uuml;nschenswert&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Ihre Aufgaben:&lt;/p&gt;&lt;p&gt;Sie entwickeln selbst&amp;auml;ndig kleinere Projekte oder Teilprojekte f&amp;uuml;r Kunden oder unterst&amp;uuml;tzen den Kunden remote bei der Umsetzung von Softwareprojekten. Falls erforderlich stehen Sie unseren Kunden auch als Technologieberater und Trainer zur Verf&amp;uuml;gung, unterst&amp;uuml;tzen bei Technologieentscheidungen und f&amp;uuml;hren deren Entwickler in neue Praktiken ein.&lt;/p&gt;&lt;p&gt;Sie werden au&amp;szlig;erdem bei der Entwicklung eigener SaaS- und Mobile-L&amp;ouml;sungen t&amp;auml;tig sein.&lt;/p&gt;&lt;p&gt;Das Unternehmen:&lt;/p&gt;&lt;p&gt;Die GUTSCH-ONLINE Software GmbH ist ein Startup im westlichen Bodensee-Raum, das ab Oktober an den Markt gegangen ist. Die Auftragslage ist hervorragend und die Startup-Phase ist gesichert. Bereits jetzt k&amp;ouml;nnen wir mehrere bekannte Software-Unternehmen zu unseren Kunden z&amp;auml;hlen. &lt;/p&gt;&lt;p&gt;Das Ziel der GUTSCH-ONLINE Software GmbH ist es, qualitativ hochwertige Software zu erstellen und diese Qualit&amp;auml;t auch dem Kunden zu vermitteln. Um dieses Ziel zu erreichen halten wir uns an das Clean Code Developer Wertesystem.&lt;/p&gt;&lt;p&gt;Was bieten wir:&lt;/p&gt;&lt;p&gt;Einen Arbeitsplatz in einer Region in der andere Urlaub machen, abwechslungsreiche Projekte, interessante Kunden, neueste Technologien, umfangreiche Fortbildungsm&amp;ouml;glichkeiten und Softwareentwicklung wie sie sein muss.&lt;/p&gt;&lt;p&gt;Wir sind der Meinung, dass nur zufriedene Mitarbeiter H&amp;ouml;chstleistungen erbringen k&amp;ouml;nnen. Somit legen wir auf die Mitarbeiterzufriedenheit gro&amp;szlig;en Wert. Bei uns sind auch Teilzeitarbeitsmodelle sowie Home-Office m&amp;ouml;glich&lt;/p&gt;&lt;p&gt;Interessenten melden sich bitte mit einer aussagekr&amp;auml;ftigen Bewerbung per E-Mail unter &lt;a href="mailto:info@gutsch-online.de"&gt;info@gutsch-online.de&lt;/a&gt;&amp;nbsp;oder per Post an:&lt;/p&gt;&lt;p&gt;GUTSCH-ONLINE Software GmbH&lt;br /&gt;z. H. J&amp;uuml;rgen Gutsch&lt;br /&gt;Am Bahndamm 3&lt;br /&gt;78234 Engen&lt;/p&gt;&lt;p&gt;Ihr Ansprechpartner ist J&amp;uuml;rgen Gutsch&lt;/p&gt;</text>
          <link></link>
          <picture></picture>
          <picturepos>Left</picturepos>
        </element>
      </elements>
    </container>
  </containers>
</page>