<?xml version="1.0" encoding="utf-8"?>
<page>
  <attributes>
    <pagename>Beratung</pagename>
    <name>beratung</name>
    <menuname>Beratung</menuname>
    <pageidentifier>german/consulting/beratung</pageidentifier>
    <status>open</status>
    <template></template>
    <metakeywords></metakeywords>
    <metadescription>So funktioniert unsere Beratung</metadescription>
    <lastedited></lastedited>
  </attributes>
  <containers>
    <container name="content">
      <elements>
        <element type="paragraph">
          <text>&lt;h1&gt;Beratung&lt;/h1&gt;&lt;p&gt;Vier Bausteine bilden das Fundament der Software-Entwicklung. Je besser und solider das Fundament ist, desto Stabiler und Hochwertiger wird die Software sein. Alle vier Bausteine steigern die Qualit&amp;auml;t Ihrer Software.&lt;/p&gt;</text>
          <link></link>
          <picture></picture>
          <picturepos>Left</picturepos>
        </element>
        <element type="paragraph">
          <text>&lt;h2&gt;Technologie&lt;/h2&gt;&lt;p&gt;Die Technologie ist f&amp;uuml;r die Entstehung guter Software nicht unbedingt entscheidend. Entscheidend dagegen ist, wie die Technologie eingesetzt wird und ob das wissen rund um die Technologie ausreichend f&amp;uuml;r den Einsatz ist. Wir unterst&amp;uuml;tzen Sie bei der Wahl der richtigen Technologie f&amp;uuml;r Ihr Softwareprojekt und helfen Ihnen den ersten und wichtigsten Grundstein f&amp;uuml;r Ihr Projekt zu legen.&lt;/p&gt;</text>
          <link></link>
          <picture></picture>
          <picturepos>Left</picturepos>
        </element>
        <element type="paragraph">
          <text>&lt;h2&gt;Infrastruktur&lt;/h2&gt;&lt;p&gt;Gute Infrastruktur ist in vielen Softwareprojekten leider viel zu wenig anzutreffen. Gute Infrastruktur erleichtert das Arbeiten an der Software und automatisiert bestimmte Teilprozesse von der Entwicklung, &amp;uuml;ber das Testen,&amp;nbsp;bis hin zum Verteilen der Software.&lt;/p&gt;&lt;p&gt;Die Entwicklungsumgebung umfasst mehr als nur die klassische IDE. Code-Versionierung, automatische Build auf einer standardisierten Umgebung, automatische Tests, Aufgaben- und Fehlerverwaltung sind wichtige Bestandteile der Entwicklungsumgebung und helfen dabei Geld und Zeit zu sparen.&lt;/p&gt;&lt;p&gt;Lassen Sie sich von uns beim Aufbau der richtigen Entwicklungsumgebung unterst&amp;uuml;tzen. Wir werden mit Ihnen zusammen eine Umgebung schaffen die am besten zu Ihrem Unternehmen und Ihren Prozessen passt.&lt;/p&gt;</text>
          <link></link>
          <picture></picture>
          <picturepos>Left</picturepos>
        </element>
        <element type="paragraph">
          <text>&lt;h2&gt;Architektur&lt;/h2&gt;&lt;p&gt;Wenn die Wahl der Technologie getroffen ist und die Infrastruktur steht, sollte man sich Gedanken &amp;uuml;ber die Architektur machen. Gute Architektur ist die Voraussetzung f&amp;uuml;r eine wartbare und evolvierbare Software und ist ein weiterer wichtiger Baustein f&amp;uuml;r Ihre Software. &lt;/p&gt;&lt;p&gt;Allerdings ist die Architektur einer Software ein Baustein, der w&amp;auml;hrend der gesamten Entwicklungszeit gepflegt, kontrolliert und eventuell angepasst werden muss. Sorgen Sie daf&amp;uuml;r, dass die Architektur Ihrer Software genauso flexibel und wartbar ist, wie Ihre Software selber. &lt;/p&gt;&lt;p&gt;Gerne helfen wir&amp;nbsp;Ihnen beim Aufbau und bei der Pflege Ihrer Software-Architektur&lt;/p&gt;</text>
          <link></link>
          <picture></picture>
          <picturepos>Left</picturepos>
        </element>
        <element type="paragraph">
          <text>&lt;h2&gt;Qualit&amp;auml;t &lt;/h2&gt;&lt;p&gt;Genauso wie die Architektur, sorgt die Code-Qualit&amp;auml;t f&amp;uuml;r wartbare und evolvierbare Software und auch der Teil, der im Laufe eines Projektes mehr und mehr vernachl&amp;auml;ssigt wird. Aber auch dieser Baustein der Software-Entwicklung kann teilweise automatisiert werden. &lt;/p&gt;&lt;p&gt;Lassen Sie sich von uns zeigen, wie Sie Code-Qualit&amp;auml;t&amp;nbsp;sicherstellen k&amp;ouml;nnen, wie Sie die Qualit&amp;auml;t steigern k&amp;ouml;nnen und wie sie die Kontrolle und Sicherstellung der Code-Qualit&amp;auml;t in Ihre Infrastruktur integrieren k&amp;ouml;nnen. Lassen Sie sich zeigen wie Sie bei Ihren Mitarbeitern das Bewusstsein f&amp;uuml;r Qualit&amp;auml;t steigern k&amp;ouml;nnen.&lt;/p&gt;</text>
          <link></link>
          <picture></picture>
          <picturepos>Left</picturepos>
        </element>
      </elements>
    </container>
  </containers>
</page>